БухЭксп/Reports/CW_ПрогонозДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_ПрогонозДвиженияДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПрогнозОплатыПлановыхСтатейБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПрогнозОплатыПлановыхСтатейБюджета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрогнозДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_НаправлениеСортировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_НаправлениеСортировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоВозрастанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУбыванию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Reports/CW_ПрогонозДвиженияДенежныхСредств/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) 
	
	НастройкиОтчета = ПолучитьИзВременногоХранилища(АдресНастроек);
	Если НастройкиОтчета = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	КлючВарианта = НастройкиОтчета.Получить("КлючВарианта");  
	Если КлючВарианта = Неопределено Тогда
		КлючВарианта = "ОсновнойПоМесяцам";
	КонецЕсли;     
	
	ВариантОтчета = СхемаКомпоновкиДанных.ВариантыНастроек.Найти(КлючВарианта);
	КомпоновщикНастроек.ЗагрузитьНастройки(ВариантОтчета.Настройки); 
	
	ВнешниеНастройкиКомпановки = НастройкиОтчета.Получить("НастройкиКомпановщика");
	Если ВнешниеНастройкиКомпановки <> Неопределено Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить(); 
		Для Каждого ЭлементОтбораВнешний из ВнешниеНастройкиКомпановки.Отбор.Элементы Цикл
			ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ЭлементОтбора, ЭлементОтбораВнешний);
		КонецЦикла;
	КонецЕсли;   
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;   

	ВариантФормирования = НастройкиОтчета.Получить("ВариантФормирования"); 
	
	Если ВариантФормирования = 0 Тогда
		ПериодОтчета = НастройкиОтчета.Получить("ПериодОтчета"); 
	Иначе
		ПериодОтчета = ПолучитьПеориодОтчетаПоОтбору(НастройкиСКД.Отбор, КлючВарианта);	
	КонецЕсли;
	
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ДатаНачала", 		ПериодОтчета.ДатаНачала, 	НастройкиСКД.ПараметрыДанных);  
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ДатаОкончания", 	ПериодОтчета.ДатаОкончания, НастройкиСКД.ПараметрыДанных);  
	
	ИсключитьВнутрихолдинговыеРасчеты = НастройкиОтчета.Получить("ИсключитьВнутрихолдинговыеРасчеты");
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ВключитьВнутрихолдинговыеРасчеты", ИсключитьВнутрихолдинговыеРасчеты, НастройкиСКД.ПараметрыДанных);  
	
	//Дополним выбранные поля выбранными показателями  
	Показатели = НастройкиОтчета.Получить("Показатели");
	УстановитьПоказателиКомпоновкиДанных(НастройкиСКД.Выбор.Элементы, Показатели);	
	
	//----
	// формируем структуру отчета по группировкам 
	ТаблицаСтруктуры   = НастройкиСКД.Структура[0]; 
	ГруппировкаОтчета  = ТаблицаСтруктуры.Строки[0];  
	ГруппировкаОтчета.Структура.Очистить(); 
	
	СоответствиеПорядка = ПолучитьСоответствиеПорядка();
	
	Группировки = НастройкиОтчета.Получить("Группировки"); 
	Для Каждого СтрокаГруппировки из Группировки Цикл  
		ТипУпорядочивания = СоответствиеПорядка.Получить(СтрокаГруппировки.Сортировка);
		ГруппировкаОтчета = ДобавитьГруппировкуКомпоновкиДанных(ГруппировкаОтчета, СтрокаГруппировки.ИмяПоля, ТипУпорядочивания);
	КонецЦикла;
	
КонецПроцедуры 

Функция ПолучитьПеориодОтчетаПоОтбору(Отбор, КлючВарианта)
	
	Для Каждого ЭлементОтбора из Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Грузоперевозка") Тогда  
			
			Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
				МассивПеревозок = Новый Массив;
				МассивПеревозок.Добавить(ЭлементОтбора.ПравоеЗначение);	
			ИначеЕсли ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				МассивПеревозок = ЭлементОтбора.ПравоеЗначение.ВыгрузитьЗначения();  
			Иначе
				ВызватьИсключение "Некорректный отбор по грузоперевозке!";
			КонецЕсли;
			Возврат ПолучитьПериодОтбораПоМассиву(МассивПеревозок, КлючВарианта);
		КонецЕсли;
	КонецЦикла;
	
	ПериодОтчета = новый СтандартныйПериод;
	ПериодОтчета.ДатаНачала 	= НачалоГода(ТекущаяДата());
	ПериодОтчета.ДатаОкончания 	= КонецГода(ТекущаяДата());
	
	Возврат ПериодОтчета
	
КонецФункции  

Функция ПолучитьПериодОтбораПоМассиву(МассивПеревозок, КлючВарианта)
	
	ДатаНачала 		= Неопределено;
	ДатаОкончания 	= Неопределено;
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("МассивПеревозок", МассивПеревозок); 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	МИНИМУМ(CW_ПрогнозОплатыПлановыхСтатейБюджета.ПрогнозДата) КАК ПрогнозДата
	               |ИЗ
	               |	РегистрСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета КАК CW_ПрогнозОплатыПлановыхСтатейБюджета
	               |ГДЕ
	               |	CW_ПрогнозОплатыПлановыхСтатейБюджета.СтатьяБюджета.Владелец В(&МассивПеревозок)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаНачала = Выборка.ПрогнозДата;
	КонецЕсли; 
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(CW_ПрогнозОплатыПлановыхСтатейБюджета.ПрогнозДата) КАК ПрогнозДата
	               |ИЗ
	               |	РегистрСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета КАК CW_ПрогнозОплатыПлановыхСтатейБюджета
	               |ГДЕ
	               |	CW_ПрогнозОплатыПлановыхСтатейБюджета.СтатьяБюджета.Владелец В(&МассивПеревозок)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаОкончания = КонецДня(Выборка.ПрогнозДата);
	КонецЕсли;     
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = НачалоГода(ТекущаяДата());	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = КонецГода(ТекущаяДата());	
	КонецЕсли;
	
	Если КлючВарианта = "ОсновнойПоДням" Тогда 
		ДатаНачала 		= НачалоДня(ДатаНачала);
		ДатаОкончания 	= КонецДня(ДатаОкончания);
	ИначеЕсли КлючВарианта = "ОсновнойПоНеделям" Тогда
		ДатаНачала 		= НачалоНедели(ДатаНачала);
		ДатаОкончания 	= КонецНедели(ДатаОкончания);
	ИначеЕсли КлючВарианта = "ОсновнойПоМесяцам" Тогда
		ДатаНачала 		= НачалоМесяца(ДатаНачала);
		ДатаОкончания 	= КонецМесяца(ДатаОкончания);
	ИначеЕсли КлючВарианта = "ОсновнойПоКварталам" Тогда
		ДатаНачала 		= НачалоКвартала(ДатаНачала);
		ДатаОкончания 	= КонецКвартала(ДатаОкончания);
	ИначеЕсли КлючВарианта = "ОсновнойПоГодам" Тогда   
		ДатаНачала 		= НачалоГода(ДатаНачала);
		ДатаОкончания 	= КонецГода(ДатаОкончания);
	КонецЕсли;
	
	ПериодОтчета = новый СтандартныйПериод;
	ПериодОтчета.ДатаНачала 	= ДатаНачала;
	ПериодОтчета.ДатаОкончания 	= ДатаОкончания;
	
	Возврат ПериодОтчета;
	
КонецФункции

Функция ПолучитьСоответствиеПорядка()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию"), НаправлениеСортировкиКомпоновкиДанных.Возр);
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоУбыванию"), НаправлениеСортировкиКомпоновкиДанных.Убыв);

	Возврат Соответствие;
	
КонецФункции

Функция ДобавитьГруппировкуКомпоновкиДанных(ГруппировкаОтчета, ИмяПоля, ТипУпорядочивания) 
	
	ЭлементГруппировки = ГруппировкаОтчета.Структура.Добавить(); 
	ЭлементГруппировки.Использование 	= Истина;
	ЭлементГруппировки.Состояние 		= СостояниеЭлементаНастройкиКомпоновкиДанных.Включен; 
	
	ЭлементГруппировки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	ПолеГруппирвоки = ЭлементГруппировки.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппирвоки.Поле 			= Новый ПолеКомпоновкиДанных(ИмяПоля);  
	ПолеГруппирвоки.Использование 	= Истина;    
	
	ЭлементПорядка = ЭлементГруппировки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));  
	ЭлементПорядка.Использование = Истина;
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля); 
	ЭлементПорядка.ТипУпорядочивания = ТипУпорядочивания;  
	
	Возврат ЭлементГруппировки;
	
КонецФункции

Процедура УстановитьПоказателиКомпоновкиДанных(Элементы, Показатели) Экспорт
	
	Для каждого ПолеВыбора из Элементы Цикл
		Если ТипЗнч(ПолеВыбора) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			УстановитьПоказателиКомпоновкиДанных(ПолеВыбора.Элементы, Показатели);	
		КонецЕсли;
		Значение = Показатели.Получить(СокрЛП(ПолеВыбора.Поле));
		Если Значение <> Неопределено Тогда
			ПолеВыбора.Использование = Значение;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
